#+begin_src lilypond
\version "2.24.3"
\include "config.lilypond"

\header {
  title = "小鴨子"
}

\relative {
  \time 2/4
  \tempo "Moderato"

  g'8\staccato g\staccato e\staccato e\staccato |
  g8\staccato g\staccato e\staccato e\staccato |
  d\staccato e\staccato e\staccato d\staccato |
  c2 |
  \break

  a'8\staccato a\staccato f\staccato f\staccato |
  a8\staccato a\staccato f\staccato f\staccato |
  e\staccato g\staccato g\staccato e\staccato |
  e2 |
  \break

  c8\staccato c8\staccato c4 |
  c8\staccato c\staccato a\staccato c\staccato |
  f8\staccato f\staccato f\staccato g\staccato |
  a2 |
  \break

  b8\staccato b8\staccato a4 |
  g8\staccato g\staccato f\staccato f\staccato |
  e\staccato d\staccato e\staccato f\staccato |
  g2 |
  \break

  b8\staccato b8\staccato a4 |
  g8\staccato g\staccato f\staccato f\staccato |
  e8\staccato e\staccato d\staccato d\staccato |
  c2 |
  \break
}

\addlyrics {

  "5" "5" "3" "3" |
  "5" "5" "3" "3" |
  "2" "3" "3" "2" |
  "1" |

  "6" "6" "4" "4" |
  "6" "6" "4" "4" |
  "3" "5" "5" "3" |
  "2" |
  "1" "1" "1" |
  "1" "1" "6" "1" |
  "4" "4" "4" "5" |
  "6" |
  "7" "7" "6" |
  "5" "5" "4" "4" |
  "3" "2" "3" "4" |
  "5" |
  "7" "7" "6" |
  "5" "5" "4" "4" |
  "3" "3" "2" "2" |
  "1" |
}
#+end_src

#+RESULTS:
: No midi file generated so can’t play!
